---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ViewFailures.CannotToggleToPerspective
source: html/b41baa20-3657-250d-f11e-9e4e9b62eb0b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ViewFailures.CannotToggleToPerspective Property

Cannot toggle to perspective view because the view contains annotations.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotToggleToPerspective { get; }
```